data.org
#+HUGO_BASE_DIR: .

** Setting up (Neo)vim for React development :vim:react:editor:js:web:
   :PROPERTIES:
   :EXPORT_HUGO_SECTION: posts/
   :EXPORT_FILE_NAME: setting-up-vim-for-react
   :EXPORT_DATE: 2019-05-03
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: aliases /post/setting-up-vim-for-react
   :END:

It's been 8 months since I have been using (neo)vim as my primary text
editor. Initially it was incredibly tough to adopt and use it in work.
Well that would be another story to tell.

Back then I was working mostly in backend using
[[https://coffeescript.org/][CoffeeScript]] (I know 🙈). VS Code had a
little support for CoffeeScript so I didn't had any problems using vim
full time.

But things changed drastically when I moved into UI development this
year. I had to spend hours reading blogs, threads on reddit to create at
least a workable setup for a hassle-less React enviornment. Here I am
sharing my vim setup for JS/React development.

#+BEGIN_QUOTE
  Note: I am using [[https://github.com/VundleVim/Vundle.vim][Vundle]]
  for plugin management.
#+END_QUOTE

*** *Syntax Highlighting*
    :PROPERTIES:
    :CUSTOM_ID: syntax-highlighting
    :END:

Out of the box vim/nvim supports syntax highlighting for major
programming languages.

#+BEGIN_SRC bash
  ls /usr/share/vim/vim80/syntax/
#+END_SRC

[[https://github.com/mxw/vim-jsx][vim-jsx]] is by far the best jsx
plugin for vim.
[[https://github.com/pangloss/vim-javascript][vim-javascript]] provides
better syntax highlighting and code folding support compared to the
default one.

#+BEGIN_SRC vim
  Plugin 'mxw/vim-jsx'
  Plugin 'pangloss/vim-javascript'
#+END_SRC

But It is yet to add =jsx= to its inventory. Also there are some
javascript specific plugins that makes syntax highlighting much better.

*** *Linters and Formatters*
    :PROPERTIES:
    :CUSTOM_ID: linters-and-formatters
    :END:

Well everyone has a love hate relationship with linters. Nobody likes
those annoying red lines on the editor the moment they add a newline.

But with vim You are in luck. [[https://github.com/w0rp/ale][ALE]] is a
nice plugin that asynchronously checks for syntatical errors in the
code. It supports mnay language specific linters and formatters. ALE
also lets people configure the signs for errors and warnings.

#+BEGIN_SRC vim
  Plugin 'w0rp/ale'
#+END_SRC

For JS/React development to add =eslint= as a linter and =prettier= I
added this to my vimrc

#+BEGIN_SRC vim
  let g:ale_linters = {
    \ 'javascript': ['eslint'],
    \}

  let g:ale_fixers = {
    \ 'javascript': ['prettier', 'eslint']
    \ }
#+END_SRC

I also mapped =leader+d= as my ale fixer and configured to format each
time I save the file.

#+BEGIN_SRC vim
  let g:ale_fix_on_save = 1
  nmap <leader>d <Plug>(ale_fix)
#+END_SRC

*** *Autocompletion*
    :PROPERTIES:
    :CUSTOM_ID: autocompletion
    :END:

Auto completion in vim is not as good as any modern IDE but
[[https://github.com/Shougo/deoplete.nvim][Deoplete]] is worth taking a look.

Check the [[https://github.com/Shougo/deoplete.nvim#install][repo]] for installation guides.

*** *Commenting*
:PROPERTIES:
:CUSTOM_ID: commenting
:END:

Though this is not specific to any particular language I would like to
discuss an excellent plugin which is pretty good at commenting and
uncommenting code.
[[https://github.com/scrooloose/nerdcommenter][NerdCommenter]]
definitely going to save you a few additional key-presses a day and
being a vimmer is all about that.

#+BEGIN_SRC vim
  Plugin 'scrooloose/nerdcommenter'
#+END_SRC

*** *conclusion*
    :PROPERTIES:
    :CUSTOM_ID: conclusion
    :END:

With vim it's hard to find an universal config that suits everyone. It's
always solving one problem at a time that led me here. This is
definitely not a full fledge solution to this but it seems to work
pretty well for me. So if you have any suggestion feel free to ping me
on [[https://twitter.com/ThisIsRudra][Twitter]].

My full vim setup can be found
[[https://github.com/mrprofessor/dotfiles/blob/master/.vimrc][here]].
